package com.weconex.kotlin.personlib;

/**
 * Created by user on 2018/3/19.
 */

public class NormalConst {

    public enum 四季 {春,夏,}

    public enum 时辰 {子,丑,寅,卯,辰,巳,午,未,申,酉,戌,亥}

    public enum 五行 {金,木,水,火,土}

    public enum 十二经 {胆经,肝经,肺经,大肠经,胃经,脾经,心经,小肠经,膀胱经,肾经,心包经,三焦经}

    public enum 阴阳 {阳明,太阳,少阳,厥阴,少阴,太阴}

    public enum 足阳明胃经 {承泣,四白,巨髎,地仓,大迎,颊车,下关,头维,人迎,水突,气舍,缺盆,气户,库房,屋翳,
        膺窗,乳中,乳根,不容,承满,梁门,关门,太乙,滑肉门,天枢,外陵,大巨,水道,归来,气冲,髀关,伏兔,阴市,梁丘,
        犊鼻,足三里,上巨虚,条口,下巨虚,丰隆,解溪,冲阳,陷谷,内庭,厉兑}

    public enum 手阳明大肠经 {商阳,二间,三间,合谷,偏历,温溜,上廉,手三里,曲池,肘髎,手五里,臂臑,肩髃,巨骨,
        天鼎,扶突,口禾髎,迎香,阳谿,下廉}

    public enum 手少阳三焦经 {关冲,液门,中渚,阳池,支沟,会宗,三阳络,四渎,天井,清冷渊,消泺,臑会,肩髎,天牖,
        翳风,瘈脉,颅息,角孙,耳门,耳和髎,丝竹空,外关}

    public enum 足少阳胆经 {瞳子髎,听会,上关,颔厌,悬颅,悬厘,曲鬓,率谷,天冲,浮白,头窍阴,完骨,本神,阳白,
        头临泣,目窗,正营,承灵,脑空,风池,肩井,渊腋,辄筋,日月,京门,带脉,五枢,维道,居髎,环跳,风市,中渎,膝阳关,
        阳陵泉,阳交,外丘,光明,阳辅,悬钟,丘墟,足临泣,地五会,侠溪,足窍阴}

    public enum 手太阳小肠经 {少泽,前谷,后溪,腕骨,阳谷,养老,支正支正,小海,肩贞肩贞,臑俞,天宗,秉风,曲垣,
        肩外俞,肩中俞,天窗天窗,天容,颧髎,听宫}

    public enum 足太阳膀胱经 {睛明,攒竹,眉冲,曲差,五处,承光,通天,络却,玉枕,天柱,大杼,风门,肺俞,厥阴俞,
        心俞,督俞,膈俞,肝俞,胆俞,脾俞,胃俞,三焦俞,肾俞,气海俞,大肠俞,关元俞,小肠俞,膀胱俞,中膂俞,白环俞,
        上髎,次髎,中髎,下髎,会阳,承扶,殷门,浮郄,委阳,委中,附分,魄户,膏肓俞,神堂,譩譆,膈关,魂门,阳纲,意舍,
        胃仓,肓门,志室,胞肓,秩边,合阳,承筋,承山,飞扬,跗阳,昆仑,仆参,申脉,金门,京骨,束骨,足通谷,至阴}

    public enum 手太阴脾经 {隐白,大都,太白,公孙,商丘,三阴交,漏谷,阴陵泉,血海,箕门,冲门,府舍,腹结,大横,
        腹哀,大包,食窦,天溪,胸乡,周荣}

    public enum 足太阴肺经 {中府,天府,侠白,尺泽,孔最,列缺,经渠,太渊,鱼际,少商,云门}

    public enum 手厥阴心包经 {天池,天泉,曲泽,郄门,间使,内关,大陵,劳宫,中冲}

    public enum 足厥阴肝经 {大敦,行间,太冲,中封,蠡沟,中都,膝关,曲泉,阴包,足五里,阴廉,急脉,章门,期门}

    public enum 手少阴心经 {极泉,青灵,少海,灵道,通里,阴隙,神门,少府,少冲}

    public enum 足少阴肾经 {涌泉,然谷,太溪,大钟,水泉,照海,复溜,交信,筑宾,阴谷,横骨,大赫,气穴,四满,
        中注,肓俞,商曲,石关,阴都,腹通谷,幽门,步廊,神封,灵墟,神藏,彧中,俞府}


}
